In [1]:
import pandas as pd #pandas mutable datatype

In [5]:
file = open("info.csv",'x')
file.close()

In [19]:
info = ""
file = open("info.csv",'w')
file.write("name,age,add\n") #for heading in spreadsheet #no space in between name age because it takes space too
n = int(input("Enter n: "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    info += f"{name},{age},{add}\n" #make sure to put comma.. csv is comma seperated value

file.write(info)
file.close()

Enter n: 6
Enter name = Ram
Enter age = 10
Enter add = Boudha
Enter name = Shyam
Enter age = 10
Enter add = Swoyambhu
Enter name = Hari
Enter age = 20
Enter add = Chabahil
Enter name = James
Enter age = 30
Enter add = Mitrapark
Enter name = Jenny
Enter age = 40
Enter add = Gaushala
Enter name = Jill
Enter age = 50
Enter add = NewRoad

In [24]:
df = pd.read_csv("info.csv")
df

    name  age        add
0    Ram   10     Boudha
1  Shyam   10  Swoyambhu
2   Hari   20   Chabahil
3  James   30  Mitrapark
4  Jenny   40   Gaushala
5   Jill   50    NewRoad

In [21]:
print(df)

    name  age        add
0    Ram   10     Boudha
1  Shyam   10  Swoyambhu
2   Hari   20   Chabahil
3  James   30  Mitrapark
4  Jenny   40   Gaushala
5   Jill   50    NewRoad

In [60]:
df = pd.read_csv("info.csv",nrows=3)
df

    name  age        add
0    Ram   10     Boudha
1  Shyam   10  Swoyambhu
2   Hari   20   Chabahil

In [61]:
df.head() #gives 5 data from top

    name  age        add
0    Ram   10     Boudha
1  Shyam   10  Swoyambhu
2   Hari   20   Chabahil

In [62]:
df = pd.read_csv("info.csv")
df.head(3)

    name  age        add
0    Ram   10     Boudha
1  Shyam   10  Swoyambhu
2   Hari   20   Chabahil

In [63]:
df = pd.read_csv("info.csv")
df.tail(3)

    name  age        add
3  James   30  Mitrapark
4  Jenny   40   Gaushala
5   Jill   50    NewRoad

In [64]:
df = pd.read_csv("info.csv", usecols = ["name","add"])
df #the data shown below is dataframe

    name        add
0    Ram     Boudha
1  Shyam  Swoyambhu
2   Hari   Chabahil
3  James  Mitrapark
4  Jenny   Gaushala
5   Jill    NewRoad

In [54]:
df.iloc[2:5]

    name        add
2   Hari   Chabahil
3  James  Mitrapark
4  Jenny   Gaushala

In [55]:
df["add"]

0       Boudha
1    Swoyambhu
2     Chabahil
3    Mitrapark
4     Gaushala
5      NewRoad
Name: add, dtype: object

In [56]:
df["add"] == "Boudha"

0     True
1    False
2    False
3    False
4    False
5    False
Name: add, dtype: bool

In [57]:
df[df["add"] == "Boudha"]

  name     add
0  Ram  Boudha

In [59]:
df[(df["add"] == "Boudha") | (df["add"] == "NewRoad")]

   name      add
0   Ram   Boudha
5  Jill  NewRoad

In [68]:
df = pd.read_csv("info.csv")
df[(df["add"] == "Boudha") & (df["age"] >= 5)]

  name  age     add
0  Ram   10  Boudha

In [84]:
#adding new columns
df = pd.read_csv("info.csv")
df["sn"] = [i for i in range(1,7)]
df

    name  age        add  sn
0    Ram   10     Boudha   1
1  Shyam   10  Swoyambhu   2
2   Hari   20   Chabahil   3
3  James   30  Mitrapark   4
4  Jenny   40   Gaushala   5
5   Jill   50    NewRoad   6

In [85]:
#list insde dict can also be converted into dataframe
data = {'sn':[7,8],'age':[22,27],"name":["Shyam","Hari"],"add":["Kathmandu","Lalitpur"]}
data

{'sn': [7, 8],
 'age': [22, 27],
 'name': ['Shyam', 'Hari'],
 'add': ['Kathmandu', 'Lalitpur']}

In [86]:
df1 = pd.DataFrame(data)
df1

   sn  age   name        add
0   7   22  Shyam  Kathmandu
1   8   27   Hari   Lalitpur

In [88]:
df = pd.read_csv("info.csv")
df["sn"] = [i for i in range(1,7)]
df = pd.concat([df,df1])
df
#uncolumned index since u can see 0 and 1 in added data

    name  age        add  sn
0    Ram   10     Boudha   1
1  Shyam   10  Swoyambhu   2
2   Hari   20   Chabahil   3
3  James   30  Mitrapark   4
4  Jenny   40   Gaushala   5
5   Jill   50    NewRoad   6
0  Shyam   22  Kathmandu   7
1   Hari   27   Lalitpur   8

In [89]:
df.to_csv("new_data.csv")

In [94]:
df = pd.read_csv("new_data.csv",usecols=["sn","name","age","add"],index_col="sn")
df

     name  age        add
sn
1     Ram   10     Boudha
2   Shyam   10  Swoyambhu
3    Hari   20   Chabahil
4   James   30  Mitrapark
5   Jenny   40   Gaushala
6    Jill   50    NewRoad
7   Shyam   22  Kathmandu
8    Hari   27   Lalitpur

In [100]:
df.drop([3,4], axis = 0) #rows are axis 0

     name  age        add
sn
1     Ram   10     Boudha
2   Shyam   10  Swoyambhu
5   Jenny   40   Gaushala
6    Jill   50    NewRoad
7   Shyam   22  Kathmandu
8    Hari   27   Lalitpur

In [101]:
df.drop(["age"], axis = 1) #columns are axis 1

     name        add
sn
1     Ram     Boudha
2   Shyam  Swoyambhu
3    Hari   Chabahil
4   James  Mitrapark
5   Jenny   Gaushala
6    Jill    NewRoad
7   Shyam  Kathmandu
8    Hari   Lalitpur